
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы =
	         "Справочник.Пользователи.Форма.ФормаСписка" Тогда
		
		ПараметрыФормы.Вставить("Отбор", "Пользователи");
		
	КонецЕсли;
	
	ОткрытьФорму(
		"Справочник.Пользователи.Форма.ПользователиИнформационнойБазы",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
